module.exports = {
  config: {
    name: "eplist",
    version: "1.0.1",
    permission: 0,
    credits: "Helal",
    description: "Show Ephoto template list in simple UI",
    category: "image",
    usages: "/eplist",
    cooldowns: 3
  },

  onStart: async function ({ api, event }) {
    const templates = {
      1: "𝙵𝚘𝚐𝚐𝚢 𝙶𝚕𝚊𝚜𝚜 𝙷𝚊𝚗𝚍𝚠𝚛𝚒𝚝𝚒𝚗𝚐",
      2: "𝙲𝚕𝚘𝚞𝚍 𝚃𝚎𝚡𝚝 𝙴𝚏𝚏𝚎𝚌𝚝",
      3: "𝙻𝚒𝚐𝚑𝚝 𝙶𝚕𝚘𝚠 𝚃𝚎𝚡𝚝",
      4: "𝙶𝚕𝚒𝚝𝚌𝚑 𝙴𝚏𝚏𝚎𝚌𝚝",
      5: "𝟹𝙳 𝙼𝚎𝚝𝚊𝚕 𝚃𝚎𝚡𝚝",
      6: "𝙵𝚘𝚐 & 𝚁𝚊𝚒𝚗𝚢 𝚃𝚎𝚡𝚝",
      7: "𝙱𝚎𝚊𝚌𝚑 𝚂𝚊𝚗𝚍 𝚆𝚛𝚒𝚝𝚒𝚗𝚐",
      8: "𝙳𝚒𝚊𝚖𝚘𝚗𝚍 𝚃𝚎𝚡𝚝",
      9: "𝙽𝚎𝚘𝚗 𝙼𝚞𝚕𝚝𝚒𝚌𝚘𝚕𝚘𝚛 𝚂𝚒𝚐𝚗",
      10: "𝙱𝚛𝚘𝚔𝚎𝚗 𝙶𝚕𝚊𝚜𝚜 𝚃𝚎𝚡𝚝",
      11: "𝙰𝚛𝚛𝚘𝚠 𝚂𝚒𝚐𝚗𝚊𝚝𝚞𝚛𝚎",
      12: "𝙶𝚛𝚊𝚏𝚏𝚒𝚝𝚒 𝚆𝚊𝚕𝚕 𝚃𝚎𝚡𝚝",
      13: "𝚆𝚊𝚝𝚎𝚛𝚌𝚘𝚕𝚘𝚛 𝚃𝚎𝚡𝚝",
      14: "𝙽𝚒𝚐𝚑𝚝 𝙶𝚕𝚘𝚠 𝙴𝚏𝚏𝚎𝚌𝚝",
      15: "𝚂𝚔𝚢 𝙲𝚕𝚘𝚞𝚍 𝚃𝚎𝚡𝚝",
      16: "𝙱𝚎𝚊𝚌𝚑 𝚂𝚊𝚗𝚍 𝟸",
      17: "𝙳𝚊𝚛𝚔 𝙶𝚛𝚎𝚎𝚗 𝚃𝚢𝚙𝚘𝚐𝚛𝚊𝚙𝚑𝚢",
      18: "𝙽𝚒𝚐𝚑𝚝 𝚂𝚝𝚊𝚛 𝚃𝚎𝚡𝚝",
      19: "𝟹𝙳 𝚂𝚊𝚗𝚍 𝚃𝚎𝚡𝚝",
      20: "𝙱𝚎𝚊𝚌𝚑 𝚂𝚞𝚖𝚖𝚎𝚛 𝚃𝚎𝚡𝚝",
      21: "𝙵𝚒𝚛𝚎𝚠𝚘𝚛𝚔 𝚃𝚎𝚡𝚝",
      22: "𝙻𝚎𝚊𝚏 𝙻𝚒𝚐𝚊𝚝𝚞𝚛𝚎",
      23: "𝚆𝚛𝚒𝚝𝚎 𝙾𝚗 𝙻𝚎𝚊𝚟𝚎𝚜",
      24: "𝙲𝚘𝚕𝚘𝚛 𝙶𝚛𝚊𝚏𝚏𝚒𝚝𝚒",
      25: "𝙿𝚊𝚙𝚎𝚛 𝙲𝚞𝚝",
      26: "𝙳𝚛𝚊𝚐𝚘𝚗 𝙵𝚒𝚛𝚎",
      27: "𝙸𝚌𝚎 𝙵𝚛𝚘𝚣𝚎𝚗",
      28: "𝙿𝚞𝚛𝚙𝚕𝚎 𝚂𝚑𝚒𝚗𝚎",
      29: "𝙱𝚞𝚕𝚋 𝙻𝚒𝚐𝚑𝚝 𝚃𝚎𝚡𝚝",
      30: "𝙷𝚎𝚊𝚛𝚝 𝙵𝚕𝚊𝚜𝚑𝚕𝚒𝚐𝚑𝚝",
      31: "𝙱𝚕𝚞𝚎 𝙼𝚎𝚝𝚊𝚕",
      32: "𝙻𝚒𝚐𝚑𝚝 𝚂𝚝𝚛𝚘𝚔𝚎",
      33: "𝙵𝚒𝚛𝚎𝚠𝚘𝚛𝚔 𝚅𝚒𝚋𝚛𝚊𝚗𝚝",
      34: "𝙻𝚘𝚐𝚘 𝚃𝚎𝚡𝚝",
      35: "𝙲𝚑𝚛𝚒𝚜𝚝𝚖𝚊𝚜 𝙱𝚊𝚕𝚕",
      36: "𝙴𝚛𝚊𝚜𝚎𝚛 𝙳𝚎𝚕𝚎𝚝𝚎",
      37: "𝙲𝚘𝚖𝚒𝚌 𝙱𝚘𝚘𝚖",
      38: "𝙵𝚞𝚝𝚞𝚛𝚎 𝚃𝚎𝚌𝚑 𝙻𝚒𝚐𝚑𝚝",
      39: "𝙶𝚘𝚕𝚍𝚎𝚗 𝙲𝚑𝚛𝚒𝚜𝚝𝚖𝚊𝚜",
      40: "𝚂𝚗𝚘𝚠 𝟹𝙳 𝚃𝚎𝚡𝚝",
      42: "𝚂𝚙𝚊𝚛𝚔𝚕𝚎 𝙲𝚑𝚛𝚒𝚜𝚝𝚖𝚊𝚜",
      43: "𝙳𝚛𝚊𝚐𝚘𝚗 𝙱𝚊𝚕𝚕",
      44: "𝟹𝙳 𝙲𝚘𝚖𝚒𝚌 𝚃𝚎𝚡𝚝",
      45: "𝙶𝚛𝚎𝚎𝚗 𝙱𝚛𝚞𝚜𝚑",
      46: "𝙽𝚒𝚐𝚑𝚝 𝙱𝚕𝚞𝚎 𝙴𝚏𝚏𝚎𝚌𝚝",
      47: "𝙶𝚊𝚕𝚊𝚡𝚢 𝚂𝚙𝚊𝚌𝚎",
      48: "𝙳𝚛𝚊𝚐𝚘𝚗 𝙵𝚒𝚛𝚎 𝚅𝟸",
      49: "𝙿𝚊𝚒𝚗𝚝 𝚂𝚙𝚕𝚊𝚝𝚝𝚎𝚛",
      50: "𝙷𝚊𝚕𝚕𝚘𝚠𝚎𝚎𝚗 𝙵𝚒𝚛𝚎",
      51: "𝙷𝚘𝚛𝚛𝚘𝚛 𝙱𝚕𝚘𝚘𝚍",
      52: "𝙽𝚊𝚛𝚞𝚝𝚘 𝚂𝚑𝚒𝚙𝚙𝚞𝚍𝚎𝚗",
      53: "𝙷𝚊𝚕𝚕𝚘𝚠𝚎𝚎𝚗 𝙵𝚒𝚛𝚎 𝚅𝟸",
      54: "𝙷𝚘𝚛𝚛𝚘𝚛 𝙶𝚊𝚝𝚎",
      55: "𝙽𝚎𝚘𝚗 𝙳𝚎𝚟𝚒𝚕 𝚆𝚒𝚗𝚐𝚜"
    };

    let msg = "📌 𝙴𝚙𝚑𝚘𝚝𝚘 𝚃𝚎𝚖𝚙𝚕𝚊𝚝𝚎 𝙻𝚒𝚜𝚝\n\n";

    let toggle = true;

    for (const id in templates) {
      const emoji = toggle ? "🟢" : "🔴";
      toggle = !toggle;

      msg += `${emoji} ${id} ➔ ${templates[id]}\n`;
    }

    msg += `\n👉 𝚄𝚜𝚎: /ephoto <ID> <text>`;

    return api.sendMessage(msg, event.threadID, event.messageID);
  }
};